9.org
#+TITLE: 主模式
#+SETUPFILE: ./resource/template.org

* 在本章：
*我的Quips文件*
*主模式框架*
*改变段落的定义*
*Quip命令*
*键位表*
*Narrowing*
*继承模式*

编写一个简单的主模式跟子模式非常像，就像我们在[[file:7.org][第7章]]中所看到的那样。在本章中我们将只接触到主模式的基础知识，为创建更复杂的主模式做好准备--实际上，一个全新的应用--在下一章。

* 我的Quips文件
多年来我一直从互联网上收集一些风趣的谚语，并且使用老牌UNIX程序fortune所使用的格式将它们存储在一个称为Quips的文件里。每个谚语都会使用一行包含%%的行开始。下面是一个例子：
#+BEGIN_SRC text
  %%
  I like a man who grins when he fights.
  - Winston Churchill %%
  %%
  The human race has one really effective weapon, and that is laughter.
  - Mark Twain
#+END_SRC

除了%%的行，其他内容的格式都是没有限制的。

在编辑了我的Quips文件一段时间后，我发现编辑它跟编辑普通文本文件有一些区别。例如，我经常需要将我的编辑限制到一个单独的谚语里以防止意外影响到邻近的谚语。另一点，每当我需要在一个谚语的开头插入一个段落的时候，我首先需要将它跟开头的%%之间插入一个空行。否则，%%就变成了段落的一部分：
#+BEGIN_SRC text
  %%
  I like a man who grins when he fights.
  - Winston Churchill
  %%The human race has one really effective weapon, and that is laughter.
  - Mark Twain
#+END_SRC

插入空行告诉Emacs"%%"并不是段落的一部分。在填充完段落之后，我会将文本追加到%%的后面并且删除空行。

很显然我需要一个新的编辑模式，一个能够避免这么多不方便的模式。问题是，这应该是一个主模式还是子模式呢？前面说过主模式不能跟其他主模式共存，而子模式可以与主模式以及其他激活的子模式独立的激活和关闭。在这个例子中，对于编辑模式的需求来源于数据格式本身，因此我们需要一个主模式而不是子模式。这种数据格式的文件总是需要这个而不是别的主模式。例如，你不会希望使用一个编辑Lisp的主模式再额外使用一个编辑谚语的子模式。[[[9-34][34]]]

* 主模式框架
定义主模式有如下步骤。
1. 选择一个名称(name)。我们模式的名称为quip。
2. 创建一个与名称同名的name.el文件来保存模式相关的代码。
3. 创建一个称为name-mode-hook的钩子变量。它用来管理进入这个模式的时候用户要执行的钩子函数。
    #+BEGIN_SRC emacs-lisp
      (defvar quip-mode-hook nil
        "*List of functions to call when entering Quip mode.*")
    #+END_SRC
4. 如果需要的话，定义一个模式关联的键位表(keymap)(参照本章后面的[[键位表][键位表]]章节)。将它赋值给一个名为name-mode-map的变量。像下面这样定义一个模式的键位表：
    #+BEGIN_SRC emacs-lisp
      (defvar name-mode-map nil
        "Keymap for name major mode.")
      (if name-mode-map
          nil
        (setq name-mode-map (make-keymap))
        (define-key name-mode-map keysequence command)
        ...)
    #+END_SRC

   如果不使用make-keymap，你还可以使用make-sparse-keymap，它更适合只包含较少键绑定的键位表。
5. 如果需要的话，定义一个模式关联的语法表(参照[[file:7.org][第七章]]的[[file:7.org::*小调整][小调整]]章节)。将它赋值给一个名为name-mode-syntax-table的变量。
6. 如果需要的话，定义一个模式关联的缩写表(abbrev table)。将它赋值给一个名为name-mode-abbrev-table的变量。
7. 定义一个名为name-mode的命令。这是主模式命令，并且没有参数(跟子模式不同，那可以有一个可选参数)。当执行时，它会通过下面的步骤使当前buffer进入name-mode：
   1. 它必须调用kill-all-lcoal-variables，这会移除掉所有buffer-local的变量。这会高效地关闭所有处于激活状态的主模式和子模式。
        #+BEGIN_SRC emacs-lisp
          (kill-all-local-variables)
        #+END_SRC
   2. 它必须将变量major-mode设置为name-mode。
        #+BEGIN_SRC emacs-lisp
          (seqt major-mode 'quip-mode)
        #+END_SRC
   3. 它必须将变量mode-name设置为一个用来描述这个模式的缩写字符串，这将会出现在buffer的模式栏里。
        #+BEGIN_SRC emacs-lisp
          (setq mode-name "Quip")
        #+END_SRC
   4. 如果键位表存在的话，它必须对其安装，这是通过将name-mode-map传递给use-local-map完成的。
   5. 它必须通过向run-hooks传递name-mode-hook执行用户的钩子函数。
        #+BEGIN_SRC emacs-lisp
          (run-hooks 'quip-mode-hook)
        #+END_SRC
8. 它必须通过provide name"提供"这个代码所实现的特性（参照[[file:5.org][第五章]]中的章节[[file:5.org::*以代码加载][以代码加载]]）。
    #+BEGIN_SRC emacs-lisp
      (provide 'quip)
    #+END_SRC
    
我们第一个版本的Quip模式将不会加入键位表，语法表以及缩写表，所以最初quip.el看起来是这样的：
#+BEGIN_SRC emacs-lisp
  (defvar quip-mode-hook nil
    "*List of functions to call when entering Quip mode.")
  (defun quip-mode ()
    "Major mode for editing Quip files."
    (interactive)
    (kill-all-local-variables)
    (setq major-mode 'quip-mode)
    (setq mode-name "Quip")
    (run-hooks 'quip-mode-hook))
  (provide 'quip)
#+END_SRC

这些只是基础，所有主模式都会实现这些。现在让我们开始向其中添加Quip模式的内容。

* 改变段落的定义
首先，我们必须使得包含%%的行不能被认为是段落的一部分。这意味着我们必须更改变量paragraph-separate，它的值是一个用来描述用于分隔段落的行的正则表达式。我们还要修改paragraph-start，一个用来描述段落开头或者分隔段落的行的正则表达式。[[[9-35][35]]]

Emacs使用paragraph-start和paragraph-separate中的正则表达式来匹配行的开头，即使正则表达式中并不包含元字符^(用来匹配行的开头)。

在Text模式中paragraph-start的值是"[ \t\n\^L]"，这表示如果一行以空格、tab、新行[[[9-36][36]]]或者Control-L(ASCII中的"formfeed"符)开头，那么这行要么是段落的第一行，要么是分隔段落的行。

Text模式中paragraph-separate的值是"[ \t^L]*$"，这表示如果一行中包含0个或多个空格、tabs、formfeeds，或者一些他们的组合，并且没有其他字符，那么它不属于任何段落。

我们要做的是修改这些正则，使其认为"一个包含着%%的行也是一个段落分隔符"。

第一步是使这些变量在Quip模式中的时候拥有不同的值。(也就是说，修改这些本来是全局变量的值的时候不会影响其他不在Quip模式中的值)因此，除了在上一部分我们描述的基本框架之外，方法quip-mode还需要这么做：
#+BEGIN_SRC emacs-lisp
  (make-local-variable 'paragraph-start)
  (make-local-variable 'paragraph-separate)
#+END_SRC

下一步，quip-mode需要设置paragraph-start和paragraph-separate的buffer局部的值。
#+BEGIN_SRC emacs-lisp
  (setq paragraph-start "%%\\|[ \t\n\^L]")
  (setq paragraph-separate "%%$\\|[ \t\^L]*$")
#+END_SRC

paragraph-start表示“%%或者空格、tab、换行或者control-L”。paragraph-separate的值表示“只有%%或者只有0个或多个空格、tab或者分页符”。具体查看[[file:4.org][第四章]]中的[[file:4.org::*正则表达式][正则表达式]]章节。

