html/9.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2018-02-27 Tue 09:37 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>主模式</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Shuai Zhao" />
<link rel="stylesheet" type="text/css" href="../resource/org.css" />
</head>
<body>
<div id="content">
<h1 class="title">主模式</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org566d501">1. 在本章：</a></li>
<li><a href="#orgec45c64">2. 我的Quips文件</a></li>
<li><a href="#org3871fba">3. 主模式框架</a></li>
<li><a href="#org97a3ce7">4. 改变段落的定义</a></li>
<li><a href="#orge648501">5. Quip命令</a></li>
<li><a href="#orga4f236b">6. 键位表</a></li>
<li><a href="#org838d7f1">7. Narrowing</a></li>
<li><a href="#orga3b844f">8. 继承模式</a></li>
</ul>
</div>
</div>

<div id="outline-container-org566d501" class="outline-2">
<h2 id="org566d501"><span class="section-number-2">1</span> 在本章：</h2>
<div class="outline-text-2" id="text-1">
<p>
<b>我的Quips文件</b><br />
<b>主模式框架</b><br />
<b>改变段落的定义</b><br />
<b>Quip命令</b><br />
<b>键位表</b><br />
<b>Narrowing</b><br />
<b>继承模式</b><br />
</p>

<p>
编写一个简单的主模式跟子模式非常像，就像我们在<a href="7.html">第7章</a>中所看到的那样。在本章中我们将只接触到主模式的基础知识，为创建更复杂的主模式做好准备&#x2013;实际上，一个全新的应用&#x2013;在下一章。<br />
</p>
</div>
</div>

<div id="outline-container-orgec45c64" class="outline-2">
<h2 id="orgec45c64"><span class="section-number-2">2</span> 我的Quips文件</h2>
<div class="outline-text-2" id="text-2">
<p>
多年来我一直从互联网上收集一些风趣的谚语，并且使用老牌UNIX程序fortune所使用的格式将它们存储在一个称为Quips的文件里。每个谚语都会使用一行包含%%的行开始。下面是一个例子：<br />
</p>
<div class="org-src-container">
<pre class="src src-text">%%
I like a man who grins when he fights.
- Winston Churchill %%
%%
The human race has one really effective weapon, and that is laughter.
- Mark Twain
</pre>
</div>

<p>
除了%%的行，其他内容的格式都是没有限制的。<br />
</p>

<p>
在编辑了我的Quips文件一段时间后，我发现编辑它跟编辑普通文本文件有一些区别。例如，我经常需要将我的编辑限制到一个单独的谚语里以防止意外影响到邻近的谚语。另一点，每当我需要在一个谚语的开头插入一个段落的时候，我首先需要将它跟开头的%%之间插入一个空行。否则，%%就变成了段落的一部分：<br />
</p>
<div class="org-src-container">
<pre class="src src-text">%%
I like a man who grins when he fights.
- Winston Churchill
%%The human race has one really effective weapon, and that is laughter.
- Mark Twain
</pre>
</div>

<p>
插入空行告诉Emacs"%%"并不是段落的一部分。在填充完段落之后，我会将文本追加到%%的后面并且删除空行。<br />
</p>

<p>
很显然我需要一个新的编辑模式，一个能够避免这么多不方便的模式。问题是，这应该是一个主模式还是子模式呢？前面说过主模式不能跟其他主模式共存，而子模式可以与主模式以及其他激活的子模式独立的激活和关闭。在这个例子中，对于编辑模式的需求来源于数据格式本身，因此我们需要一个主模式而不是子模式。这种数据格式的文件总是需要这个而不是别的主模式。例如，你不会希望使用一个编辑Lisp的主模式再额外使用一个编辑谚语的子模式。[<a href="#orgfaa21ac">34</a>]<br />
</p>
</div>
</div>

<div id="outline-container-org3871fba" class="outline-2">
<h2 id="org3871fba"><span class="section-number-2">3</span> 主模式框架</h2>
<div class="outline-text-2" id="text-3">
<p>
定义主模式有如下步骤。<br />
</p>
<ol class="org-ol">
<li>选择一个名称(name)。我们模式的名称为quip。<br /></li>
<li>创建一个与名称同名的name.el文件来保存模式相关的代码。<br /></li>
<li><p>
创建一个称为name-mode-hook的钩子变量。它用来管理进入这个模式的时候用户要执行的钩子函数。<br />
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #AE81FF;">(</span><span style="color: #F92672;">defvar</span> <span style="color: #FD971F;">quip-mode-hook</span> nil
  <span style="color: #75715E;">"*List of functions to call when entering Quip mode.*"</span><span style="color: #AE81FF;">)</span>
</pre>
</div></li>
<li><p>
如果需要的话，定义一个模式关联的键位表(keymap)(参照本章后面的<a href="#orga4f236b">键位表</a>章节)。将它赋值给一个名为name-mode-map的变量。像下面这样定义一个模式的键位表：<br />
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #AE81FF;">(</span><span style="color: #F92672;">defvar</span> <span style="color: #FD971F;">name-mode-map</span> nil
  <span style="color: #75715E;">"Keymap for name major mode."</span><span style="color: #AE81FF;">)</span>
<span style="color: #AE81FF;">(</span><span style="color: #F92672;">if</span> name-mode-map
    nil
  <span style="color: #66D9EF;">(</span><span style="color: #F92672;">setq</span> name-mode-map <span style="color: #A6E22E;">(</span>make-keymap<span style="color: #A6E22E;">)</span><span style="color: #66D9EF;">)</span>
  <span style="color: #66D9EF;">(</span>define-key name-mode-map keysequence command<span style="color: #66D9EF;">)</span>
  ...<span style="color: #AE81FF;">)</span>
</pre>
</div>

<p>
如果不使用make-keymap，你还可以使用make-sparse-keymap，它更适合只包含较少键绑定的键位表。<br />
</p></li>
<li>如果需要的话，定义一个模式关联的语法表(参照<a href="7.html">第七章</a>的<a href="7.html#MissingReference">小调整</a>章节)。将它赋值给一个名为name-mode-syntax-table的变量。<br /></li>
<li>如果需要的话，定义一个模式关联的缩写表(abbrev table)。将它赋值给一个名为name-mode-abbrev-table的变量。<br /></li>
<li>定义一个名为name-mode的命令。这是主模式命令，并且没有参数(跟子模式不同，那可以有一个可选参数)。当执行时，它会通过下面的步骤使当前buffer进入name-mode：<br />
<ol class="org-ol">
<li><p>
它必须调用kill-all-lcoal-variables，这会移除掉所有buffer-local的变量。这会高效地关闭所有处于激活状态的主模式和子模式。<br />
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #AE81FF;">(</span>kill-all-local-variables<span style="color: #AE81FF;">)</span>
</pre>
</div></li>
<li><p>
它必须将变量major-mode设置为name-mode。<br />
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #AE81FF;">(</span>seqt major-mode 'quip-mode<span style="color: #AE81FF;">)</span>
</pre>
</div></li>
<li><p>
它必须将变量mode-name设置为一个用来描述这个模式的缩写字符串，这将会出现在buffer的模式栏里。<br />
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #AE81FF;">(</span><span style="color: #F92672;">setq</span> mode-name <span style="color: #E6DB74;">"Quip"</span><span style="color: #AE81FF;">)</span>
</pre>
</div></li>
<li>如果键位表存在的话，它必须对其安装，这是通过将name-mode-map传递给use-local-map完成的。<br /></li>
<li><p>
它必须通过向run-hooks传递name-mode-hook执行用户的钩子函数。<br />
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #AE81FF;">(</span>run-hooks 'quip-mode-hook<span style="color: #AE81FF;">)</span>
</pre>
</div></li>
</ol></li>
<li><p>
它必须通过provide name"提供"这个代码所实现的特性（参照<a href="5.html">第五章</a>中的章节<a href="5.html#MissingReference">以代码加载</a>）。<br />
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #AE81FF;">(</span><span style="color: #F92672;">provide</span> '<span style="color: #AE81FF;">quip</span><span style="color: #AE81FF;">)</span>
</pre>
</div></li>
</ol>

<p>
我们第一个版本的Quip模式将不会加入键位表，语法表以及缩写表，所以最初quip.el看起来是这样的：<br />
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #AE81FF;">(</span><span style="color: #F92672;">defvar</span> <span style="color: #FD971F;">quip-mode-hook</span> nil
  <span style="color: #75715E;">"*List of functions to call when entering Quip mode."</span><span style="color: #AE81FF;">)</span>
<span style="color: #AE81FF;">(</span><span style="color: #F92672;">defun</span> <span style="color: #A6E22E;">quip-mode</span> <span style="color: #66D9EF;">()</span>
  <span style="color: #75715E;">"Major mode for editing Quip files."</span>
  <span style="color: #66D9EF;">(</span><span style="color: #F92672;">interactive</span><span style="color: #66D9EF;">)</span>
  <span style="color: #66D9EF;">(</span>kill-all-local-variables<span style="color: #66D9EF;">)</span>
  <span style="color: #66D9EF;">(</span><span style="color: #F92672;">setq</span> major-mode 'quip-mode<span style="color: #66D9EF;">)</span>
  <span style="color: #66D9EF;">(</span><span style="color: #F92672;">setq</span> mode-name <span style="color: #E6DB74;">"Quip"</span><span style="color: #66D9EF;">)</span>
  <span style="color: #66D9EF;">(</span>run-hooks 'quip-mode-hook<span style="color: #66D9EF;">)</span><span style="color: #AE81FF;">)</span>
<span style="color: #AE81FF;">(</span><span style="color: #F92672;">provide</span> '<span style="color: #AE81FF;">quip</span><span style="color: #AE81FF;">)</span>
</pre>
</div>

<p>
这些只是基础，所有主模式都会实现这些。现在让我们开始向其中添加Quip模式的内容。<br />
</p>
</div>
</div>

<div id="outline-container-org97a3ce7" class="outline-2">
<h2 id="org97a3ce7"><span class="section-number-2">4</span> 改变段落的定义</h2>
<div class="outline-text-2" id="text-4">
<p>
首先，我们必须使得包含%%的行不能被认为是段落的一部分。这意味着我们必须更改变量paragraph-separate，它的值是一个用来描述用于分隔段落的行的正则表达式。我们还要修改paragraph-start，一个用来描述段落开头或者分隔段落的行的正则表达式。[<a href="#orgada43a7">35</a>]<br />
</p>

<p>
Emacs使用paragraph-start和paragraph-separate中的正则表达式来匹配行的开头，即使正则表达式中并不包含元字符<sup>(用来匹配行的开头)</sup>。<br />
</p>

<p>
在Text模式中paragraph-start的值是"[ \t\n\<sup>L</sup>]"，这表示如果一行以空格、tab、新行[<a href="#orga59d99d">36</a>]或者Control-L(ASCII中的"formfeed"符)开头，那么这行要么是段落的第一行，要么是分隔段落的行。<br />
</p>

<p>
Text模式中paragraph-separate的值是"[ \t<sup>L</sup>]*$"，这表示如果一行中包含0个或多个空格、tabs、formfeeds，或者一些他们的组合，并且没有其他字符，那么它不属于任何段落。<br />
</p>

<p>
我们要做的是修改这些正则，使其认为"一个包含着%%的行也是一个段落分隔符"。<br />
</p>

<p>
第一步是使这些变量在Quip模式中的时候拥有不同的值。(也就是说，修改这些本来是全局变量的值的时候不会影响其他不在Quip模式中的值)因此，除了在上一部分我们描述的基本框架之外，方法quip-mode还需要这么做：<br />
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #AE81FF;">(</span>make-local-variable 'paragraph-start<span style="color: #AE81FF;">)</span>
<span style="color: #AE81FF;">(</span>make-local-variable 'paragraph-separate<span style="color: #AE81FF;">)</span>
</pre>
</div>

<p>
下一步，quip-mode需要设置paragraph-start和paragraph-separate的buffer局部的值。<br />
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #AE81FF;">(</span><span style="color: #F92672;">setq</span> paragraph-start <span style="color: #E6DB74;">"%%</span><span style="color: #AE81FF;">\\</span><span style="color: #E6DB74;">|</span><span style="color: #E6DB74;">[ \t\n\^L]"</span><span style="color: #AE81FF;">)</span>
<span style="color: #AE81FF;">(</span><span style="color: #F92672;">setq</span> paragraph-separate <span style="color: #E6DB74;">"%%$</span><span style="color: #AE81FF;">\\</span><span style="color: #E6DB74;">|</span><span style="color: #E6DB74;">[ \t\^L]*$"</span><span style="color: #AE81FF;">)</span>
</pre>
</div>

<p>
paragraph-start表示“%%或者空格、tab、换行或者control-L”。paragraph-separate的值表示“只有%%或者只有0个或多个空格、tab或者分页符”。具体查看<a href="4.html">第四章</a>中的<a href="4.html#MissingReference">正则表达式</a>章节。<br />
</p>
</div>
</div>
