9.org
* Quip命令
Quip模式还需要做什么呢？
+ 它应该允许用户每次向前或者向后移动一条谚语。
+ 它应该允许用户只操作一条谚语。
+ 它应该展示出文件中谚语的条目数，并且告诉用户当前光标下的谚语是第几条。
+ 除此之外，它应该与Text模式大概相似。毕竟，操作的内容基本上就是纯文本。

让我们暂停一下，重新观察一下Emacs中不同的光标移动命令。forward-char和backward-char每次移动一个字母。还有forward-word和backward-word。还有forward-line和previous-line。还有一些命令用来每次移动一句、一个段落、一页。

什么是一页呢？通常，一页以分页符开始，这是因为传统打字机在新的一页开始的时候，打字员需要发送一个contrl-L给设备。但是在Emacs里工作的时候，我们可以通过改变page-delimiter来重新定义构成“页”的元素。
#+BEGIN_SRC emacs-lisp
  (make-local-variable 'page-delimiter)
  (setq page-delimiter "^%%$")
#+END_SRC

这一转换--将“页”转换为“谚语”--解决了大部分我们对于Quip模式的需求！现在Emacs的很多内置的页相关的命令都能应用于谚语了：
+ backward-page和forward-page，通常绑定到C-x [和C-x ]上，允许每次移动一条谚语
+ narrow-to-page，绑定在C-x n p上，通过narrow操作来只编辑一条谚语（参照本章中的[[Narrowing][Narrowing]]章节）
+ what-page查看当前的谚语是第几条

我们基本上完全借用了Emacs操作页面的命令，反正无所谓：在Quip模式里，这些命令反正用不到，因为Quip文件本身就不会分页。

* 键位表
不幸的是，这些命令的名字－－backward-page和forward-page以及其他的命令－－使得这些方法在Quip模式中变得易于混淆，因为我们操作的是谚语而不是页面。因此这么做是明智的：
#+BEGIN_SRC emacs-lisp
  (defalias 'backward-quip 'backward-page)
  (defalias 'forward-quip forward-page)
  (defalias 'narrow-to-quip 'narrow-to-page)
  (defalias 'what-quip 'what-page)
#+END_SRC

但是这并不够。即使定义了这些别名，已经存在的绑定－－C-x[，C-x ]，以及C-x n p－－仍然绑定到了“页”的命令上，所以当用户在Quip模式中使用describe-bindings列出键绑定的时候，他们将会看到：
| C-x [   | backward-page  |
| C-x ]   | forward-page   |
| C-x n p | narrow-to-page |

（以及其他的页相关函数）但是这些与谚语都没关系。如果这些函数的名字与谚语相关就好了－－当然只是在Quip模式里。而且，我们还可以把C-x n p（这么定义是因为这表示narrow to page）改为C-x n q（narrow to quip）。我们还可以给what-quip绑定一个快捷键，默认是没有的。也就是说Quip模式需要一个关联的键位表。

键位表（keymap）是一个用来记录函数及触发它的按键的Lisp数据结构。例如，当你按下C-f时，Emacs将会查询“global”键位表并且找到C-f对应的函数，也就是forward-char。键位表中的每一条记录都代表着一条按键序列。

像是C-x C-w（write-file）这种按键需要使用嵌套键位表（nestling keymaps）来实现。在全局表里，C-x的记录包含着一个嵌套表而不是一条命令。嵌套表里包含着一条C-w的记录，它指向write-file。C-x的嵌套表还包含着一条n的记录，它指向另一个嵌套表。这个二级嵌套表包含着一条p的记录，它指向命令narrow-to-page。

指向嵌套表的按键被称为前置键（prefix key）；C-x是很多其他命令的前置键，而C-x n是更多按键的前置键（在19.16版本，你可以按下前置键后面跟着C-h来看哪些键绑定以此前置）。

任何时候，都可能有多个键位表同时处于激活状态。前面提到的全局键位表（global keymap）总是处于激活状态。它会被包含着当前buffer主模式的特定按键的局部键位表所覆盖。而局部键位表又会被处于激活状态的子模式的键位表里的记录所覆盖。[[[9-37][37]]]

让我们为本章前面所提到的Quip模式创建一个局部表。首先我们创建一个用于包含键位表的变量。它的初始值为nil。
#+BEGIN_SRC emacs-lisp
  (defvar quip-mode-map nil
    "Keymap for quip major mode.")
#+END_SRC

下一步我们在quip.el的最顶层编写一个代码块，用于当文件加载的时候加载键位表。如果quip-mode-map已经存在了--例如quip.el之前已经加载过了--那么就什么都不做。否则，就创建并且向其中添加键绑定。
#+BEGIN_SRC emacs-lisp
  (if quip-mode-map
      nil ; do nothing if quip-mode-map exists
    (setq quip-mode-map (make-sparse-keymap))
    (define-key quip-mode-map "\C-x[" 'backward-quip)
    (define-key quip-mode-map "\C-x]" 'forward-quip)
    (define-key quip-mode-map "\C-xnq" 'narrow-to-quip)
    (define-key quip-mode-map "\C-cw" 'what-quip))
#+END_SRC

我们使用make-sparse-keymap是因为Quip模式只比全局表多几个特定的绑定。只有当表里包含很多绑定的时候才需要使用make-keymap来创建一个完整的键位表。

每次调用define-key都会向quip-mode-map添加一条新的记录。当按键定义包含多于一个按键（就像本章中所有例子所展示的那样），define-key将会自动根据需要创建嵌套表。[[[9-38][38]]]

我们将what-quip绑定到了C-c w。根据习惯，模式相关的命令通常绑定到以C-c开头的按键序列。其他的命令都来自于已经存在的绑定，所以没有必要再为他们指定新的前缀。

最后，我们需要确保在Quip模式进入的时候安装新的键位表。
#+BEGIN_SRC emacs-lisp
  (defun quip-mode ()
    "Major mode for editing Quip files."
    (interactive)
    (kill-all-local-variables)
    (setq major-mode 'quip-mode)
    (setq mode-name "Quip")
    (make-local-variable 'paragraph-separate)
    (make-local-variable 'paragraph-start)
    (make-local-variable 'page-delimiter)
    (setq paragraph-start "%%\\I[ \t\n\^L]")
    (setq paragraph-separate "%%$\\ [ \t\^L]*$")
    (setq page-delimiter "^%%$")
    (use-local-map quip-mode-map) ; 这里安装键位表
    (run-hooks quip-mode-hook))
#+END_SRC

如果用户希望更改Quip模式的键绑定，他们可以通过使用模式的钩子以及local-set-key（对于Quip模式来说就是修改quip-mode-map）来达到目的：
#+BEGIN_SRC emacs-lisp
  (add-hook 'quip-mode-hook
            '(lambda ()
              (local-set-key "\M-p" backward-quip)
              (local-set-key "\M-n" 'forward-quip)
              (local-unset-key "\C-x[") ; 移除了一个绑定
              (local-unset-key "\C-x]")))
#+END_SRC

通常应该将模式的局部键位绑定放到用于描述模式的文档字符串里。但是，不应该像下面这样将默认的绑定“硬编码”到文档字符串里：
#+BEGIN_SRC emacs-lisp
  (defun quip-mode ()
    "Major mode for editing Quip files.
  Keybindings include 'C-x [' and 'C-x ]' for backward-quip
  and forward-quip, 'C-x n p' for narrow-to-quip, and 'C-c w'
  for what-quip."
    ...)
#+END_SRC

因为我们前面已经说过，用户可能会重定义按键，这样的话文档字符串就不准确了。相反的，我们可以这么写：
#+BEGIN_SRC emacs-lisp
  (defun quip-mode ()
    "Major mode for editing Quip files.
  Special commands:
  \\{quip-mode-map}"
    ...)
#+END_SRC

当用户通过describe-function或者通过describe-mode（使用所有相关模式的文档字符串来描述当前的主模式和子模式）来请求文档字符串的时候，Emacs会根据这个特殊的语法使用当前quip-mode-map中的键位绑定进行替换。

