html/9.html

<div id="outline-container-orge648501" class="outline-2">
<h2 id="orge648501"><span class="section-number-2">5</span> Quip命令</h2>
<div class="outline-text-2" id="text-5">
<p>
Quip模式还需要做什么呢？<br />
</p>
<ul class="org-ul">
<li>它应该允许用户每次向前或者向后移动一条谚语。<br /></li>
<li>它应该允许用户只操作一条谚语。<br /></li>
<li>它应该展示出文件中谚语的条目数，并且告诉用户当前光标下的谚语是第几条。<br /></li>
<li>除此之外，它应该与Text模式大概相似。毕竟，操作的内容基本上就是纯文本。<br /></li>
</ul>

<p>
让我们暂停一下，重新观察一下Emacs中不同的光标移动命令。forward-char和backward-char每次移动一个字母。还有forward-word和backward-word。还有forward-line和previous-line。还有一些命令用来每次移动一句、一个段落、一页。<br />
</p>

<p>
什么是一页呢？通常，一页以分页符开始，这是因为传统打字机在新的一页开始的时候，打字员需要发送一个contrl-L给设备。但是在Emacs里工作的时候，我们可以通过改变page-delimiter来重新定义构成“页”的元素。<br />
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #AE81FF;">(</span>make-local-variable 'page-delimiter<span style="color: #AE81FF;">)</span>
<span style="color: #AE81FF;">(</span><span style="color: #F92672;">setq</span> page-delimiter <span style="color: #E6DB74;">"^%%$"</span><span style="color: #AE81FF;">)</span>
</pre>
</div>

<p>
这一转换&#x2013;将“页”转换为“谚语”&#x2013;解决了大部分我们对于Quip模式的需求！现在Emacs的很多内置的页相关的命令都能应用于谚语了：<br />
</p>
<ul class="org-ul">
<li>backward-page和forward-page，通常绑定到C-x [和C-x ]上，允许每次移动一条谚语<br /></li>
<li>narrow-to-page，绑定在C-x n p上，通过narrow操作来只编辑一条谚语（参照本章中的<a href="#org838d7f1">Narrowing</a>章节）<br /></li>
<li>what-page查看当前的谚语是第几条<br /></li>
</ul>

<p>
我们基本上完全借用了Emacs操作页面的命令，反正无所谓：在Quip模式里，这些命令反正用不到，因为Quip文件本身就不会分页。<br />
</p>
</div>
</div>

<div id="outline-container-orga4f236b" class="outline-2">
<h2 id="orga4f236b"><span class="section-number-2">6</span> 键位表</h2>
<div class="outline-text-2" id="text-6">
<p>
不幸的是，这些命令的名字－－backward-page和forward-page以及其他的命令－－使得这些方法在Quip模式中变得易于混淆，因为我们操作的是谚语而不是页面。因此这么做是明智的：<br />
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #AE81FF;">(</span><span style="color: #F92672;">defalias</span> '<span style="color: #A6E22E;">backward-quip</span> 'backward-page<span style="color: #AE81FF;">)</span>
<span style="color: #AE81FF;">(</span><span style="color: #F92672;">defalias</span> '<span style="color: #A6E22E;">forward-quip</span> forward-page<span style="color: #AE81FF;">)</span>
<span style="color: #AE81FF;">(</span><span style="color: #F92672;">defalias</span> '<span style="color: #A6E22E;">narrow-to-quip</span> 'narrow-to-page<span style="color: #AE81FF;">)</span>
<span style="color: #AE81FF;">(</span><span style="color: #F92672;">defalias</span> '<span style="color: #A6E22E;">what-quip</span> 'what-page<span style="color: #AE81FF;">)</span>
</pre>
</div>

<p>
但是这并不够。即使定义了这些别名，已经存在的绑定－－C-x[，C-x ]，以及C-x n p－－仍然绑定到了“页”的命令上，所以当用户在Quip模式中使用describe-bindings列出键绑定的时候，他们将会看到：<br />
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">C-x [</td>
<td class="org-left">backward-page</td>
</tr>

<tr>
<td class="org-left">C-x ]</td>
<td class="org-left">forward-page</td>
</tr>

<tr>
<td class="org-left">C-x n p</td>
<td class="org-left">narrow-to-page</td>
</tr>
</tbody>
</table>

<p>
（以及其他的页相关函数）但是这些与谚语都没关系。如果这些函数的名字与谚语相关就好了－－当然只是在Quip模式里。而且，我们还可以把C-x n p（这么定义是因为这表示narrow to page）改为C-x n q（narrow to quip）。我们还可以给what-quip绑定一个快捷键，默认是没有的。也就是说Quip模式需要一个关联的键位表。<br />
</p>

<p>
键位表（keymap）是一个用来记录函数及触发它的按键的Lisp数据结构。例如，当你按下C-f时，Emacs将会查询“global”键位表并且找到C-f对应的函数，也就是forward-char。键位表中的每一条记录都代表着一条按键序列。<br />
</p>

<p>
像是C-x C-w（write-file）这种按键需要使用嵌套键位表（nestling keymaps）来实现。在全局表里，C-x的记录包含着一个嵌套表而不是一条命令。嵌套表里包含着一条C-w的记录，它指向write-file。C-x的嵌套表还包含着一条n的记录，它指向另一个嵌套表。这个二级嵌套表包含着一条p的记录，它指向命令narrow-to-page。<br />
</p>

<p>
指向嵌套表的按键被称为前置键（prefix key）；C-x是很多其他命令的前置键，而C-x n是更多按键的前置键（在19.16版本，你可以按下前置键后面跟着C-h来看哪些键绑定以此前置）。<br />
</p>

<p>
任何时候，都可能有多个键位表同时处于激活状态。前面提到的全局键位表（global keymap）总是处于激活状态。它会被包含着当前buffer主模式的特定按键的局部键位表所覆盖。而局部键位表又会被处于激活状态的子模式的键位表里的记录所覆盖。[<a href="#orga56b704">37</a>]<br />
</p>

<p>
让我们为本章前面所提到的Quip模式创建一个局部表。首先我们创建一个用于包含键位表的变量。它的初始值为nil。<br />
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #AE81FF;">(</span><span style="color: #F92672;">defvar</span> <span style="color: #FD971F;">quip-mode-map</span> nil
  <span style="color: #75715E;">"Keymap for quip major mode."</span><span style="color: #AE81FF;">)</span>
</pre>
</div>

<p>
下一步我们在quip.el的最顶层编写一个代码块，用于当文件加载的时候加载键位表。如果quip-mode-map已经存在了&#x2013;例如quip.el之前已经加载过了&#x2013;那么就什么都不做。否则，就创建并且向其中添加键绑定。<br />
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #AE81FF;">(</span><span style="color: #F92672;">if</span> quip-mode-map
    nil <span style="color: #75715E;">; </span><span style="color: #75715E;">do nothing if quip-mode-map exists</span>
  <span style="color: #66D9EF;">(</span><span style="color: #F92672;">setq</span> quip-mode-map <span style="color: #A6E22E;">(</span>make-sparse-keymap<span style="color: #A6E22E;">)</span><span style="color: #66D9EF;">)</span>
  <span style="color: #66D9EF;">(</span>define-key quip-mode-map <span style="color: #E6DB74;">"\C-x["</span> 'backward-quip<span style="color: #66D9EF;">)</span>
  <span style="color: #66D9EF;">(</span>define-key quip-mode-map <span style="color: #E6DB74;">"\C-x]"</span> 'forward-quip<span style="color: #66D9EF;">)</span>
  <span style="color: #66D9EF;">(</span>define-key quip-mode-map <span style="color: #E6DB74;">"\C-xnq"</span> 'narrow-to-quip<span style="color: #66D9EF;">)</span>
  <span style="color: #66D9EF;">(</span>define-key quip-mode-map <span style="color: #E6DB74;">"\C-cw"</span> 'what-quip<span style="color: #66D9EF;">)</span><span style="color: #AE81FF;">)</span>
</pre>
</div>

<p>
我们使用make-sparse-keymap是因为Quip模式只比全局表多几个特定的绑定。只有当表里包含很多绑定的时候才需要使用make-keymap来创建一个完整的键位表。<br />
</p>

<p>
每次调用define-key都会向quip-mode-map添加一条新的记录。当按键定义包含多于一个按键（就像本章中所有例子所展示的那样），define-key将会自动根据需要创建嵌套表。[<a href="#orge04b3a0">38</a>]<br />
</p>

<p>
我们将what-quip绑定到了C-c w。根据习惯，模式相关的命令通常绑定到以C-c开头的按键序列。其他的命令都来自于已经存在的绑定，所以没有必要再为他们指定新的前缀。<br />
</p>

<p>
最后，我们需要确保在Quip模式进入的时候安装新的键位表。<br />
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #AE81FF;">(</span><span style="color: #F92672;">defun</span> <span style="color: #A6E22E;">quip-mode</span> <span style="color: #66D9EF;">()</span>
  <span style="color: #75715E;">"Major mode for editing Quip files."</span>
  <span style="color: #66D9EF;">(</span><span style="color: #F92672;">interactive</span><span style="color: #66D9EF;">)</span>
  <span style="color: #66D9EF;">(</span>kill-all-local-variables<span style="color: #66D9EF;">)</span>
  <span style="color: #66D9EF;">(</span><span style="color: #F92672;">setq</span> major-mode 'quip-mode<span style="color: #66D9EF;">)</span>
  <span style="color: #66D9EF;">(</span><span style="color: #F92672;">setq</span> mode-name <span style="color: #E6DB74;">"Quip"</span><span style="color: #66D9EF;">)</span>
  <span style="color: #66D9EF;">(</span>make-local-variable 'paragraph-separate<span style="color: #66D9EF;">)</span>
  <span style="color: #66D9EF;">(</span>make-local-variable 'paragraph-start<span style="color: #66D9EF;">)</span>
  <span style="color: #66D9EF;">(</span>make-local-variable 'page-delimiter<span style="color: #66D9EF;">)</span>
  <span style="color: #66D9EF;">(</span><span style="color: #F92672;">setq</span> paragraph-start <span style="color: #E6DB74;">"%%\\I[ \t\n\^L]"</span><span style="color: #66D9EF;">)</span>
  <span style="color: #66D9EF;">(</span><span style="color: #F92672;">setq</span> paragraph-separate <span style="color: #E6DB74;">"%%$\\ [ \t\^L]*$"</span><span style="color: #66D9EF;">)</span>
  <span style="color: #66D9EF;">(</span><span style="color: #F92672;">setq</span> page-delimiter <span style="color: #E6DB74;">"^%%$"</span><span style="color: #66D9EF;">)</span>
  <span style="color: #66D9EF;">(</span>use-local-map quip-mode-map<span style="color: #66D9EF;">)</span> <span style="color: #75715E;">; </span><span style="color: #75715E;">&#36825;&#37324;&#23433;&#35013;&#38190;&#20301;&#34920;</span>
  <span style="color: #66D9EF;">(</span>run-hooks quip-mode-hook<span style="color: #66D9EF;">)</span><span style="color: #AE81FF;">)</span>
</pre>
</div>

<p>
如果用户希望更改Quip模式的键绑定，他们可以通过使用模式的钩子以及local-set-key（对于Quip模式来说就是修改quip-mode-map）来达到目的：<br />
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #AE81FF;">(</span>add-hook 'quip-mode-hook
          '<span style="color: #66D9EF;">(</span>lambda <span style="color: #A6E22E;">()</span>
            <span style="color: #A6E22E;">(</span>local-set-key <span style="color: #E6DB74;">"\M-p"</span> backward-quip<span style="color: #A6E22E;">)</span>
            <span style="color: #A6E22E;">(</span>local-set-key <span style="color: #E6DB74;">"\M-n"</span> 'forward-quip<span style="color: #A6E22E;">)</span>
            <span style="color: #A6E22E;">(</span>local-unset-key <span style="color: #E6DB74;">"\C-x["</span><span style="color: #A6E22E;">)</span> <span style="color: #75715E;">; </span><span style="color: #75715E;">&#31227;&#38500;&#20102;&#19968;&#20010;&#32465;&#23450;</span>
            <span style="color: #A6E22E;">(</span>local-unset-key <span style="color: #E6DB74;">"\C-x]"</span><span style="color: #A6E22E;">)</span><span style="color: #66D9EF;">)</span><span style="color: #AE81FF;">)</span>
</pre>
</div>

<p>
通常应该将模式的局部键位绑定放到用于描述模式的文档字符串里。但是，不应该像下面这样将默认的绑定“硬编码”到文档字符串里：<br />
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #AE81FF;">(</span><span style="color: #F92672;">defun</span> <span style="color: #A6E22E;">quip-mode</span> <span style="color: #66D9EF;">()</span>
  <span style="color: #75715E;">"Major mode for editing Quip files.</span>
<span style="color: #75715E;">Keybindings include 'C-x [' and 'C-x ]' for backward-quip</span>
<span style="color: #75715E;">and forward-quip, 'C-x n p' for narrow-to-quip, and 'C-c w'</span>
<span style="color: #75715E;">for what-quip."</span>
  ...<span style="color: #AE81FF;">)</span>
</pre>
</div>

<p>
因为我们前面已经说过，用户可能会重定义按键，这样的话文档字符串就不准确了。相反的，我们可以这么写：<br />
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #AE81FF;">(</span><span style="color: #F92672;">defun</span> <span style="color: #A6E22E;">quip-mode</span> <span style="color: #66D9EF;">()</span>
  <span style="color: #75715E;">"Major mode for editing Quip files.</span>
<span style="color: #75715E;">Special commands:</span>
<span style="color: #75715E;">\\{quip-mode-map}"</span>
  ...<span style="color: #AE81FF;">)</span>
</pre>
</div>

<p>
当用户通过describe-function或者通过describe-mode（使用所有相关模式的文档字符串来描述当前的主模式和子模式）来请求文档字符串的时候，Emacs会根据这个特殊的语法使用当前quip-mode-map中的键位绑定进行替换。<br />
</p>
</div>
</div>
