9.org
* Narrowing
你可能已经很熟悉Emacs的narrowing概念了。我们可以定义一个buffer的区域并且将buffer narrow到这个区域。Emacs通过隐藏前面和后面的文字而使得整个buffer好像只有这个区域。所有的编辑操作，以及大部分的Lisp函数，都会被限制到这个区域内（虽然当文件保存的时候，所有的改动都会被保存而不管是否存在narrowing），直到用户使用widen来取消narrowing，widen通常被绑定到C-x n w[[[9-39][39]]]。所以narrow-to-quip满足“将用户的编辑操作限制到一条谚语”这个需求。

Emacs Lisp代码必须要根据buffer是否处于narrow状态做处理。大多数情况，Lisp函数都不必关心这件事。它们可以表现的就像narrowed部分就是整个buffer。当处于narrowing状态时用于处理buffer边界的函数通常会处理narrowed区域的边界。例如，用来检测光标是否在buffer末尾的函数eobp（end-of-buffer-p）在光标位于narrowed区域末尾的时候会返回真。类似的，point-min和point-max在narrowed区域存在的时候会返回它的边界而不是整个buffer的。可以说，这些函数为Lisp程序员编织了一个善意的谎言，否则他们编写代码的时候就需要付出很多努力来处理narrowing相关的情况。

但是，这也需要付出代价。在某些情况下，函数需要处理narrowed区域之外的buffer。在这些情况下，需要先调用widen来使函数能够访问整个buffer。如果这个调用被放到save-restriction里，那么在代码执行后narrowing状态将会被复原。（在[[file:4.org][第四章]]里我们用过这个手段。）

让我们定义count-quips作为例子，我们必须自己进行实现，因为Emacs并没有提供任何可以让我们利用的计算页数的命令。显然不管是否有narrowing，count-quips都需要访问整个buffer。因此，我们可以这样定义它：
#+BEGIN_SRC emacs-lisp
  (defun count-quips ()
    "Count the quips in the buffer."
    (interactive)
    (save-excursion
      (save-restriction
        (widen)
        (goto-char (point-min))
        (count-matches '^%%$'))))
#+END_SRC

函数count-matches会返回一个类似于“374 matches”的字符串告诉你从当前位置往后有多少处匹配该正则的地方。

* 继承模式
我们现在已经满足了除“它应该与Text模式大概相似”之外的所有要求了。实现的方法之一就是在初始化Quip模式的时候调用text-mode；然后再执行Quip模式自己的特定配置。我们可以使用copy-keymap而不是使用make-sparse-map来创建quip-mode-map以利用text-mode的特性。
#+BEGIN_SRC emacs-lisp
  (defvar quip-mode-map nil
    "Keymap for Quip major mode.")
  (if quip-mode-map
      nil
    (setq quip-mode-map (copy-keymap text-mode-map))
    (define-key quip-mode-map "\C-x[" 'backward-quip)
    (define-key quip-mode-map "\C-x]" 'forward-quip)
    (define-key quip-mode-map "\C-xnq" 'narrow-to-quip)
    (define-key quip-mode-map "\C-cw" 'what-quip))

  (defun quip-mode ()
    "Major mode for editing Quip files.
    Special commands:
    \\{quip-mode-map}"
    (interactive)
    (kill-all-local-variables)
    (text-mode) ; 首先设置为Text模式
    (setq major-mode 'quip-mode) ; 现在，定义Quip模式
    (setq mode-name "Quip")
    (use-local-map quip-mode-map)
    (make-local-variable 'paragraph-separate)
    (make-local-variable 'paragraph-start)
    (make-local-variable 'page-delimiter)
    (setq paragraph-start "%%\\|[ \t\n\^L]")
    (setq paragraph-separate "%%$\\|[ \t\^L]*\$")
    (setq page-delimiter "^%%$")
    (run-hooks quip-mode-hook))

  (provide 'quip)
#+END_SRC

为了更好的与text-mode协作，我们还应该拷贝text-mode-syntax-table（使用copy-syntax-table），而不只是text-mode-map。当然需要处理的还有text-mode-abbrev-table（但是没有对应的copy-abbrev-table函数，也许是因为缩写表太不常用了，以至于没有人在意是不是有这个方法）。

实际上，在你克隆一个模式并且将其定制成一个新的模式的时候有许多需要做的工作。你很容易就会遗漏掉什么。幸运的是，由于继承并且修改一个模式的行为太频繁了--就像我们将文本模式修改为Quip模式--所以已经有了一个Emacs Lisp包来帮助简化这一任务。这个包被称为derived，它提供的核心函数被称为define-derived-mode。（实际上，define-derived-mode是一个宏。）下面就是用它来继承Text模式生成Quip模式的实现：
#+BEGIN_SRC emacs-lisp
  (require 'derived)

  (define-derived-mode quip-mode text-mode "Quip"
    "Major mode for editing Quip files.
   Special commands:
   \\ quip-mode-map}"
    (make-local-variable 'paragraph-separate)
    (make-local-variable 'paragraph-start)
    (make-local-variable 'page-delimiter)
    (setq paragraph-start "%%\\|[ \t\n\^L]")
    (setq paragraph-separate "%%$\\|[ \t\^L]*$")
    (setq page-delimiter "^%%$"))
  (define-key quip-mode-map "\C-x[" 'backward-quip)
  (define-key quip-mode-map "\C-x]" 'forward-quip)
  (define-key quip-mode-map "\C-xnq" 'narrow-to-quip)
  (define-key quip-mode-map "\C-cw" 'what-quip)

  (provide 'quip)
#+END_SRC

define-derived-mode的语法是
#+BEGIN_SRC emacs-lisp
  (define-derived-mode new-mode old-mode mode-line-string
    docstring
    body1
    body2
    ...)
#+END_SRC

这会创建new-mode以及所有相关的数据结构。在body语句执行的时候，new-mode-map，new-mode-syntax-table，以及new-mode-abbrev-table就已经存在了。创建new-mode指令的最后一件事是执行new-mode-hook。

本章向我们展示了如何较小的修改Emacs的行为来编辑特定类型的数据。Quip模式与Text模式并没有多少区别，因为谚语本身与文本也没多大区别。但是在下一章，我们将会创建一个用来编辑与文本差别很大的数据的主模式，它与任何其他的主模式都很不相同。

<<9-34>>[34]. 在其他的一些情况下选择主模式还是子模式就没这么清晰了。

<<9-35>>[35]. 并没有专门用来匹配段落开始的正则变量。作为替代的，段落的开始就是符合paragraph-start但是不符合paragraph-separate的行。

<<9-36>>[36]. 以一个新行“开始”的行当然是一个空行。

<<9-37>>[37]. 可以使用一个称为overriding-local-map的变量稍微更改一下这个优先级，但是这只在非常少数的情况下才有用。

<<9-38>>[38]. 函数current-global-map会返回当前的全局键位表。（有可能通过use-global-keymap改变了全局表，虽然这很少出现。）因此，(global-set-key ...)等价于(define-key (current-global-map) ...)。

<<9-39>>[39]. Narrowing不会嵌套。如果将buffer narrow到了一个区域，然后再把这个区域narrow到更小的区域，C-x n w仍然会恢复到整个buffer（也就是说，它不会恢复到前一次narrowing）。
